MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle.c
/*=================================================================================================*/
/**
*   @file    Startup_vle.c
*   @version 1.0.5
*
*   @brief   AUTOSAR Sample_app - Startup file for PowerPC VLE.
*   @details Startup file for PowerPC VLE.
*
*   @addtogroup BUILD_ENV
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : 
*   Dependencies         : Base Det Dem Port Dio Mcu Rte Wdg WdgIf CanIf LinIf FrIf EcuM
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.5
*   Build Version        : MPC5746C_MCAL_1_0_5_RTM_ASR_REL_4_0_REV_0003_20171214
*
*   (c) Copyright 2017 NXP
*   All Rights Reserved.
*
*   This file contains sample code only. It is not part of the production code deliverables.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/
/************************************************************************/
/* Autosar synopsis of startup code (See MCU Specification):            */
/*                                                                      */
/*   Before the MCU driver can be initialized, a basic initialization   */
/*   of the MCU has to be executed. This MCU specific initialization is */
/*   typically executed in a start-up code. The start-up code of the    */
/*   MCU shall be executed after power up and any kind of micro-        */
/*   controller reset. It shall perform very basic and microcontroller  */
/*   specific start-up initialization and shall be kept short, because  */
/*   the MCU clock and PLL is not yet initialized. The start-up code    */
/*   shall cover MCU specific initialization, which is not part of      */
/*   other MCU services or other MCAL drivers. The following steps      */
/*   summarizes basic functionality which shall be included in the      */
/*   start-up code. They are listed for guidance, because some          */
/*   functionality might not be supported. No code will be found in     */
/*   case.                                                              */
/************************************************************************/


#include "typedefs.h"

#include "Mcal.h"
#include "Mcal_Os.h"
#include "mpc5746c.h"

#define S_INTC_BASEADDR        0xFC040000UL
#define S_INTC_MCR             (S_INTC_BASEADDR + ((unsigned long)0x0u))
#define S_INTC_MCR_VTES_4BYTES ((unsigned long)0x00000000)    /* Vector Table Entry Size - 4 bytes */
#define S_INTC_MCR_HVEN_ON     ((unsigned long)0x00001111)    /* Hardware Vector ENable - On */
#define S_INTC_CPR0             (S_INTC_BASEADDR + ((unsigned long)0x10)) /* Current Priority Register */
#define S_INTC_CPR1            (S_INTC_BASEADDR + ((unsigned long)0x14)) /* Current Priority Register */
#define S_INTC_CPR2            (S_INTC_BASEADDR + ((unsigned long)0x18)) /* Current Priority Register */


#define S_REG_WRITE32(address, value)       (*(volatile unsigned long*)(address) = (value))


extern uint32 __RAM_NO_CACHEABLE_START; 
extern uint32 __RAM_NO_CACHEABLE_END;
extern uint32 __RAM_CACHEABLE_START;
extern uint32 __RAM_CACHEABLE_END;       

/* Function Definitions */
extern int main(void);

#ifdef CCOV_ENABLE
/* code coverage is requested */
extern void ccov_main(void);
#endif

#ifdef ENABLE_RCHECK
/* initialization for the runtime checks memory space */
void init_runtime_check(void);
#endif /* ENABLE_RCHECK */

void StartupCode(void)

{
/*****************************************************/
/* Skip normal entry point as nothing is initialized */
/*****************************************************/
    ASM_KEYWORD(".globl _start");
    ASM_KEYWORD(".globl __start");
    ASM_KEYWORD(".align 4");
    ASM_KEYWORD("_start:");
    ASM_KEYWORD("__start:");

    ASM_KEYWORD(" xor  r0, r0, r0");
    ASM_KEYWORD(" xor  r1, r1, r1");
    ASM_KEYWORD(" xor  r2, r2, r2");
    ASM_KEYWORD(" xor  r3, r3, r3");
    ASM_KEYWORD(" xor  r4, r4, r4");
    ASM_KEYWORD(" xor  r5, r5, r5");
    ASM_KEYWORD(" xor  r6, r6, r6");
    ASM_KEYWORD(" xor  r7, r7, r7");
    ASM_KEYWORD(" xor  r8, r8, r8");
    ASM_KEYWORD(" xor  r9, r9, r9");
    ASM_KEYWORD(" xor  r10, r10, r10");
    ASM_KEYWORD(" xor  r11, r11, r11");
    ASM_KEYWORD(" xor  r12, r12, r12");
    ASM_KEYWORD(" xor  r13, r13, r13");
    ASM_KEYWORD(" xor  r14, r14, r14");
    ASM_KEYWORD(" xor  r15, r15, r15");
    ASM_KEYWORD(" xor  r16, r16, r16");
    ASM_KEYWORD(" xor  r17, r17, r17");
    ASM_KEYWORD(" xor  r18, r18, r18");
    ASM_KEYWORD(" xor  r19, r19, r19");
    ASM_KEYWORD(" xor  r20, r20, r20");
    ASM_KEYWORD(" xor  r21, r21, r21");
    ASM_KEYWORD(" xor  r22, r22, r22");
    ASM_KEYWORD(" xor  r23, r23, r23");
    ASM_KEYWORD(" xor  r24, r24, r24");
    ASM_KEYWORD(" xor  r25, r25, r25");
    ASM_KEYWORD(" xor  r26, r26, r26");
    ASM_KEYWORD(" xor  r27, r27, r27");
    ASM_KEYWORD(" xor  r28, r28, r28");
    ASM_KEYWORD(" xor  r29, r29, r29");
    ASM_KEYWORD(" xor  r30, r30, r30");
    ASM_KEYWORD(" xor  r31, r31, r31");
 

/*******************************************************************/
/* Freescale Guidance 1 - Init registers to avoid lock-step issues */
/* N/A                                                             */
/*******************************************************************/

/*******************************************************************/
/* Freescale Guidance 2 - MMU Initialization for CPU               */
/*  TLB0 - PbridgeB                                                */
/*  TLB1 - Internal Flash                                          */
/*  TLB2 - External SRAM                                           */
/*  TLB3 - Internal SRAM                                           */
/*  TLB4 - PbridgeA                                                */ 
/*******************************************************************/
    
/******************************************************************/
/* Autosar Guidance 1 - The start-up code shall initialize the    */
/* base addresses for interrupt and trap vector tables. These base*/
/* addresses are provided as configuration parameters or          */
/* linker/locator setting.                                        */
/******************************************************************/
    /* Initialize IVPR register to address of Interrupt Vector Table */
    ASM_KEYWORD (" e_lis r5, __IV_ADDR@h ");
    ASM_KEYWORD (" e_or2i  r5,__IV_ADDR@l ");
    ASM_KEYWORD (" mtIVPR r5");
    ASM_KEYWORD (" se_mr   r0, r31 ");

    /* define MSR mask to enable Machine Check and Exception / IRQ */
    ASM_KEYWORD(" .equ    MSR_Mask, 0x00009000 ");
    ASM_KEYWORD(" mfmsr   r5 ");
    ASM_KEYWORD(" e_lis   r6, MSR_Mask@h ");
    ASM_KEYWORD(" e_or2i  r6, MSR_Mask@l ");
    ASM_KEYWORD(" se_or   r5, r6 ");
    ASM_KEYWORD(" mtmsr   r5 ");
    ASM_KEYWORD(" se_isync"); 

/******************************************************************/
/* Autosar Guidance 2 - The start-up code shall initialize the    */
/* interrupt stack pointer, if an interrupt stack is              */
/* supported by the MCU. The interrupt stack pointer base address */
/* and the stack size are provided as configuration parameter or  */
/* linker/locator setting.                                        */
/*                                                                */
/******************************************************************/

/******************************************************************/
/* Autosar Guidance 3 - The start-up code shall initialize the    */
/* user stack pointer. The user stack pointer base address and    */
/* the stack size are provided as configuration parameter or      */
/* linker/locator setting.                                        */
/******************************************************************/
    ASM_KEYWORD(" e_lis   r1, __SP_INIT@h");
    ASM_KEYWORD(" e_or2i    r1, __SP_INIT@l");

/******************************************************************/
/* Autosar Guidance 4 - If the MCU supports context save          */
/* operation, the start-up code shall initialize the memory which */
/* is used for context save operation. The maximum amount of      */
/* consecutive context save operations is provided as             */
/* configuration parameter or linker/locator setting.             */
/*                                                                */
/******************************************************************/

/******************************************************************/
/* Autosar Guidance 5 - The start-up code shall ensure that the   */
/* MCU internal watchdog shall not be serviced until the watchdog */
/* is initialized from the MCAL watchdog driver. This can be      */
/* done for example by increasing the watchdog service time.      */
/*                                                                */
/******************************************************************/
    
