MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle.c
    ASM_KEYWORD(" .equ AIPS_A_OPACRI, 0xFC000160 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRI@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRI@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRJ, 0xFC000164 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRJ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRJ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
        
    ASM_KEYWORD(" .equ AIPS_A_OPACRK, 0xFC000168 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRK@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRK@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRL, 0xFC00016C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRL@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRL@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRM, 0xFC000170 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRM@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRM@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRN, 0xFC000174 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRN@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRN@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRO, 0xFC000178 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRO@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRO@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRP, 0xFC00017C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRP@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRP@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRQ, 0xFC000180 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRQ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRQ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRR, 0xFC000184 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRR@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRR@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRS, 0xFC000188 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRS@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRS@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRT, 0xFC00018C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRT@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRT@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRU, 0xFC000190 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRU@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRU@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRV, 0xFC000194 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRV@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRV@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRW, 0xFC000198 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRW@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRW@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRX, 0xFC00019C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRX@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRX@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRY, 0xFC0001A0 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRY@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRY@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRZ, 0xFC0001A4 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRZ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRZ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
  
    ASM_KEYWORD(" .equ AIPS_A_OPACRAA, 0xFC0001A8 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRAB, 0xFC0001AC ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAB@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAB@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRAC, 0xFC0001B0 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAC@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAC@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRAD, 0xFC0001B4 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAD@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAD@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRAE, 0xFC0001B8 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAE@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAE@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRAF, 0xFC0001BC ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRAF@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRAF@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");

/* AIPS_B_MPROT register, which will setup all 8 master ports accordingly.         */
/*  The meaning of these four bits is as follows:                                */
/*   0 - Master Buffer Writes: no (Write accesses are not bufferable)            */
/*   1 - Master Trusted for Reads                                                */
/*   1 - Master Trusted for Writes                                               */
/*   1 - Master Priviledge Level: accesses are not forced to user-mode           */
/* NOTE: we do only setup the masters M0-M7, M8-M15 are not modified at all.     */
   
    ASM_KEYWORD(" .equ AIPS_B_MPRA, 0xF8000000 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_MPRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_MPRA@l ");
    ASM_KEYWORD(" e_lis   r5, 0x77777777@ha ");
    ASM_KEYWORD(" e_or2i  r5, 0x77777777@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4)");
    ASM_KEYWORD(" e_li r5, 0" );
    
/* Allow non-priviledged access to all peripherals (on and off-platform). This is */
/* achieved by modifying the PACR and OPACR registers in the AIPS.                */
/* To do so, we write b'0000 (0x0) into every peripheral access control reg.      */
/* The meaning of these four bits is as follows:                                  */
/*   0 - Buffer Writes: no                                                        */
/*   0 - Supervisor Protect: periph. doesn't require supervisor priviledge level  */
/*   0 - Write Protect: no (peripheral allows write accesses)                     */
/*   0 - Trusted Protect: no (accesses from an untrusted master allowed)          */

    ASM_KEYWORD(" .equ AIPS_B_PACRA, 0xF8000100 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");

    ASM_KEYWORD(" .equ AIPS_B_PACRB, 0xF8000104 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRB@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRB@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
     
    ASM_KEYWORD(" .equ AIPS_B_PACRC, 0xF8000108 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRC@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRC@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
