MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle.c
    /* Raise global priority level - to disable all interrupts */
    (*((volatile uint32_t*) (0xFFF48008)))=0xF;

    /* save parameters to global variables for further processing */
    if( (0<=code) && (code <22))
    {
        violation_storage->runtime_check_count[code]++;
    }
    else
    {
        /* unknown violation - save it to the final location */
        violation_storage->runtime_check_count[22]++;
    }
    
    /* save data for as many violations as possible */
    if( violation_storage->position< sizeof( violation_storage->data))
    {
        /* if there is still some space in the buffer, try to save the violation data */
        
        /* position must be aligned at 4 bytes - assuming the violation_storage->data is already aligned */
        violation_storage->position= (violation_storage->position+3)&0xFFFFFFFC;

        /* set position for the new violation data */
        violation_data= (Runtime_violation_info_t*) &(violation_storage->data[violation_storage->position]);
        
        /* violation buffer must have space for at least the violation type, line no + 2 chars for the filename */
        if( ( violation_storage->position + sizeof( violation_data->violation) 
            + sizeof( violation_data->line_no) + 2) < sizeof( violation_storage->data))
        {
            violation_data->violation= code;            
            violation_storage->position+= sizeof( violation_data->violation);
            violation_data->line_no= line;
            violation_storage->position+= sizeof( violation_data->line_no);
            /* copy filename - make sure that it doesn't overflow the buffer */
            max_length= sizeof( violation_storage->data)-violation_storage->position-1;
            for( counter=0; (counter<max_length) && (filename[counter]!=0); counter++)
            {
                violation_data->filename[counter]= filename[counter];
            }
            /* add null terminator to the string */
            violation_data->filename[counter]=0;
            violation_storage->position+= counter+1;            
        }
        else
        {
            /* buffer filled - set position greater than the data size */
            violation_storage->position= sizeof( violation_storage->data)+10;
        }
    }

    /* Lower global priority level - to re-enable all interrupts */
    (*((volatile uint32_t*) (0xFFF48008)))=0x0;

#if 0
    switch(code)  {
        case 1:
        OutOfBounds:
            CONSOLE_MESSAGE("Runtime error: Array index out of bounds in file = %s, line = %d\n", filename, line);
            break;
        case 3:
        NullDereference:
            CONSOLE_MESSAGE("Runtime error: NULL pointer dereference in file = %s, line = %d\n", filename, line);
            break;
        case 4:
        SwitchFallThrough:
            CONSOLE_MESSAGE("Runtime error: Case/Switch has no match in file = %s, line = %d\n", filename, line);
            break;
        case 7:
        DivideByZero:
            CONSOLE_MESSAGE("Runtime error: Divide by zero!!! in file = %s, line = %d\n", filename, line);
            break;
        case 9:
        AttemptToFree:
            CONSOLE_MESSAGE("Runtime error: Attempt to free unallocated memory in file = %s, line = %d\n", filename, line);
            break;
        case 19:
        AttemptToFree2:
            CONSOLE_MESSAGE("Runtime error: Attempt to free memory not allocated in file = %s, line = %d\n", filename, line);
            break;
        default:
        Error:
            CONSOLE_MESSAGE("Error code = %d, file = %s, line = %d\n", code, filename, line);
    }
#endif
}

void _rnerr(int code, int line, const char *filename)
{
    if (filename == NULL_PTR)
        filename = "(null)";
    MyRuntimeErrorHandler(code, line, filename);
}


 
/* initialization for the runtime checks memory space */
void init_runtime_check(void)
{
    uint32_t counter;
    uint32_t max_length;

    /* save data to specific memory address, to be dumped by the debugger script */
    violation_storage= (Runtime_violation_t*)(AUX_BUFFER_ADDR+4);
    
    /* init fields */
    max_length= sizeof(violation_storage->runtime_check_count)/sizeof(violation_storage->runtime_check_count[0]);
    for( counter=0; counter< max_length; counter++)
    {
        violation_storage->runtime_check_count[counter]= 0;
    }
    violation_storage->position= 0;
    max_length= sizeof(violation_storage->data)/sizeof(violation_storage->data[0]);
    for( counter=0; counter< max_length; counter++)
    {
        violation_storage->data[counter]= 0;
    }
}
#endif /* ENABLE_RCHECK */

